#### FabricWireItem Members

---

|  |
| --- |
| FabricWireItem Class   Methods   Properties   See Also |

The  FabricWireItem  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of a single Fabric wire. |
| Public method | Dispose | Releases all resources used by the  FabricWireItem |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Distance | Distance to the next fabric wire item Can be 0 to be used with offset along wire. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | OffsetAlongWire | Offset along wire direction Wire distance should be 0 if we want to be along the same wire |
| Public property | WireLength | Wire length for this wire item |
| Public property | WireType | The wire type of this wire item |

# See Also

FabricWireItem Class

Autodesk.Revit.DB.Structure Namespace